app/views/users/show.html.erb

	<table>
    <% @user.microposts.each do |micropost| %>
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = $1  [["user_id", 1]]