app/views/microposts/_form.html.erb

    <%= f.label :user_id %><br>
    <%= collection_select(:micropost, :user_id, User.all, :id, :name) %>
---
SELECT "users".* FROM "users"